**Branch:** main
**Commit:** 1eb0f0da76f1e14e5fd84aa091683e306b4dde6a
**Workflow:** Ping Application CI/CD Pipeline
**Triggered by:** givanov-devops
**Run ID:** 16623148667

---

📊 **Changes Summary:**
  - 🟢 Resources to create: 10
  - 🟡 Resources to modify: 0  
  - 🔴 Resources to destroy: 0

---

## 📋 Terraform Plan Preview

<details>
<summary>🔍 Click to view Plan Preview (first 50 lines)</summary>

```terraform
[command]/home/runner/work/_temp/5dd58f77-6c0a-4274-9d7b-238393cb7aa7/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_container.app_nodes[0] will be created
  + resource "docker_container" "app_nodes" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = [
          + "gunicorn",
          + "--bind",
          + "0.0.0.0:5000",
          + "--workers",
          + "2",
          + "--timeout",
          + "30",
          + "--worker-class",
          + "sync",
          + "--max-requests",
          + "1000",
          + "--max-requests-jitter",
          + "100",
          + "--preload",
          + "app:app",
        ]
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = [
          + "APP_NAME=ping-app",
          + "FLASK_DEBUG=true",
          + "FLASK_HOST=0.0.0.0",
          + "FLASK_PORT=5000",
          + "LOG_LEVEL=INFO",
        ]
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + memory                                      = 256
      + memory_swap                                 = 512
      + must_run                                    = true
```

</details>

<details>
<summary>📄 Click to view Full Terraform Plan</summary>

```terraform
[command]/home/runner/work/_temp/5dd58f77-6c0a-4274-9d7b-238393cb7aa7/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_container.app_nodes[0] will be created
  + resource "docker_container" "app_nodes" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = [
          + "gunicorn",
          + "--bind",
          + "0.0.0.0:5000",
          + "--workers",
          + "2",
          + "--timeout",
          + "30",
          + "--worker-class",
          + "sync",
          + "--max-requests",
          + "1000",
          + "--max-requests-jitter",
          + "100",
          + "--preload",
          + "app:app",
        ]
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = [
          + "APP_NAME=ping-app",
          + "FLASK_DEBUG=true",
          + "FLASK_HOST=0.0.0.0",
          + "FLASK_PORT=5000",
          + "LOG_LEVEL=INFO",
        ]
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + memory                                      = 256
      + memory_swap                                 = 512
      + must_run                                    = true
      + name                                        = "ping-app-node-1"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "unless-stopped"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval       = "30s"
          + retries        = 3
          + start_interval = "0s"
          + start_period   = "15s"
          + test           = [
              + "CMD",
              + "curl",
              + "-f",
              + "http://localhost:5000/health",
            ]
          + timeout        = "10s"
        }

      + labels {
          + label = "ManagedBy"
          + value = "terraform"
        }
      + labels {
          + label = "Owner"
          + value = "givanov-devops"
        }
      + labels {
          + label = "Project"
          + value = "ping-application"
        }
      + labels {
          + label = "app"
          + value = "ping-service"
        }
      + labels {
          + label = "app_name"
          + value = "ping-app"
        }
      + labels {
          + label = "component"
          + value = "application"
        }
      + labels {
          + label = "managed_by"
          + value = "terraform"
        }
      + labels {
          + label = "node_id"
          + value = "node-1"
        }
      + labels {
          + label = "version"
          + value = "latest"
        }

      + networks_advanced {
          + aliases      = []
          + name         = "ping-app-network"
            # (2 unchanged attributes hidden)
        }

      + ports {
          + external = 5000
          + internal = 5000
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
    }

  # docker_container.app_nodes[1] will be created
  + resource "docker_container" "app_nodes" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = [
          + "gunicorn",
          + "--bind",
          + "0.0.0.0:5000",
          + "--workers",
          + "2",
          + "--timeout",
          + "30",
          + "--worker-class",
          + "sync",
          + "--max-requests",
          + "1000",
          + "--max-requests-jitter",
          + "100",
          + "--preload",
          + "app:app",
        ]
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = [
          + "APP_NAME=ping-app",
          + "FLASK_DEBUG=true",
          + "FLASK_HOST=0.0.0.0",
          + "FLASK_PORT=5000",
          + "LOG_LEVEL=INFO",
        ]
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + memory                                      = 256
      + memory_swap                                 = 512
      + must_run                                    = true
      + name                                        = "ping-app-node-2"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "unless-stopped"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval       = "30s"
          + retries        = 3
          + start_interval = "0s"
          + start_period   = "15s"
          + test           = [
              + "CMD",
              + "curl",
              + "-f",
              + "http://localhost:5000/health",
            ]
          + timeout        = "10s"
        }

      + labels {
          + label = "ManagedBy"
          + value = "terraform"
        }
      + labels {
          + label = "Owner"
          + value = "givanov-devops"
        }
      + labels {
          + label = "Project"
          + value = "ping-application"
        }
      + labels {
          + label = "app"
          + value = "ping-service"
        }
      + labels {
          + label = "app_name"
          + value = "ping-app"
        }
      + labels {
          + label = "component"
          + value = "application"
        }
      + labels {
          + label = "managed_by"
          + value = "terraform"
        }
      + labels {
          + label = "node_id"
          + value = "node-2"
        }
      + labels {
          + label = "version"
          + value = "latest"
        }

      + networks_advanced {
          + aliases      = []
          + name         = "ping-app-network"
            # (2 unchanged attributes hidden)
        }

      + ports {
          + external = 5001
          + internal = 5000
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
    }

  # docker_container.app_nodes[2] will be created
  + resource "docker_container" "app_nodes" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = [
          + "gunicorn",
          + "--bind",
          + "0.0.0.0:5000",
          + "--workers",
          + "2",
          + "--timeout",
          + "30",
          + "--worker-class",
          + "sync",
          + "--max-requests",
          + "1000",
          + "--max-requests-jitter",
          + "100",
          + "--preload",
          + "app:app",
        ]
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = [
          + "APP_NAME=ping-app",
          + "FLASK_DEBUG=true",
          + "FLASK_HOST=0.0.0.0",
          + "FLASK_PORT=5000",
          + "LOG_LEVEL=INFO",
        ]
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + memory                                      = 256
      + memory_swap                                 = 512
      + must_run                                    = true
      + name                                        = "ping-app-node-3"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "unless-stopped"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval       = "30s"
          + retries        = 3
          + start_interval = "0s"
          + start_period   = "15s"
          + test           = [
              + "CMD",
              + "curl",
              + "-f",
              + "http://localhost:5000/health",
            ]
          + timeout        = "10s"
        }

      + labels {
          + label = "ManagedBy"
          + value = "terraform"
        }
      + labels {
          + label = "Owner"
          + value = "givanov-devops"
        }
      + labels {
          + label = "Project"
          + value = "ping-application"
        }
      + labels {
          + label = "app"
          + value = "ping-service"
        }
      + labels {
          + label = "app_name"
          + value = "ping-app"
        }
      + labels {
          + label = "component"
          + value = "application"
        }
      + labels {
          + label = "managed_by"
          + value = "terraform"
        }
      + labels {
          + label = "node_id"
          + value = "node-3"
        }
      + labels {
          + label = "version"
          + value = "latest"
        }

      + networks_advanced {
          + aliases      = []
          + name         = "ping-app-network"
            # (2 unchanged attributes hidden)
        }

      + ports {
          + external = 5002
          + internal = 5000
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
    }

  # docker_container.load_balancer will be created
  + resource "docker_container" "load_balancer" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + memory                                      = 128
      + memory_swap                                 = 256
      + must_run                                    = true
      + name                                        = "ping-app-lb"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "unless-stopped"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck (known after apply)

      + labels {
          + label = "ManagedBy"
          + value = "terraform"
        }
      + labels {
          + label = "Owner"
          + value = "givanov-devops"
        }
      + labels {
          + label = "Project"
          + value = "ping-application"
        }
      + labels {
          + label = "app"
          + value = "nginx"
        }
      + labels {
          + label = "app_name"
          + value = "ping-app"
        }
      + labels {
          + label = "component"
          + value = "load-balancer"
        }
      + labels {
          + label = "managed_by"
          + value = "terraform"
        }
      + labels {
          + label = "version"
          + value = "latest"
        }

      + networks_advanced {
          + aliases      = []
          + name         = "ping-app-network"
            # (2 unchanged attributes hidden)
        }

      + ports {
          + external = 8080
          + internal = 443
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }

      + upload {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + upload {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + upload {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # docker_image.nginx will be created
  + resource "docker_image" "nginx" {
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = true
      + name         = "nginx:alpine"
      + repo_digest  = (known after apply)
    }

  # docker_image.ping_app will be created
  + resource "docker_image" "ping_app" {
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = true
      + name         = "ping-app:latest"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "source_files_sha1" = "ef84b4ea74e706a2c7a153dc0291548b5554c82b"
        }

      + build {
          + build_args     = {
              + "APP_PORT" = "5000"
              + "VCS_REF"  = "latest"
            }
          + cache_from     = []
          + context        = "."
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + no_cache       = false
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (13 unchanged attributes hidden)
        }
    }

  # docker_network.app_network will be created
  + resource "docker_network" "app_network" {
      + driver      = "bridge"
      + id          = (known after apply)
      + internal    = (known after apply)
      + ipam_driver = "default"
      + name        = "ping-app-network"
      + options     = (known after apply)
      + scope       = (known after apply)

      + ipam_config {
          + subnet   = "172.20.0.0/16"
            # (2 unchanged attributes hidden)
        }

      + labels {
          + label = "ManagedBy"
          + value = "terraform"
        }
      + labels {
          + label = "Owner"
          + value = "givanov-devops"
        }
      + labels {
          + label = "Project"
          + value = "ping-application"
        }
      + labels {
          + label = "app_name"
          + value = "ping-app"
        }
      + labels {
          + label = "component"
          + value = "network"
        }
      + labels {
          + label = "managed_by"
          + value = "terraform"
        }
      + labels {
          + label = "version"
          + value = "latest"
        }
    }

  # tls_private_key.internal_ca[0] will be created
  + resource "tls_private_key" "internal_ca" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_self_signed_cert.internal_ca[0] will be created
  + resource "tls_self_signed_cert" "internal_ca" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "cert_signing",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = true
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "Internal CA"
          + organization = "ping-application"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_nodes                = {
      + node-1 = {
          + direct_url    = "http://localhost:5000"
          + external_port = 5000
          + health_url    = "http://localhost:5000/health"
          + hostname      = (known after apply)
          + internal_ip   = (known after apply)
          + internal_port = 5000
          + name          = "ping-app-node-1"
        }
      + node-2 = {
          + direct_url    = "http://localhost:5001"
          + external_port = 5001
          + health_url    = "http://localhost:5001/health"
          + hostname      = (known after apply)
          + internal_ip   = (known after apply)
          + internal_port = 5000
          + name          = "ping-app-node-2"
        }
      + node-3 = {
          + direct_url    = "http://localhost:5002"
          + external_port = 5002
          + health_url    = "http://localhost:5002/health"
          + hostname      = (known after apply)
          + internal_ip   = (known after apply)
          + internal_port = 5000
          + name          = "ping-app-node-3"
        }
    }
  + application_info         = {
      + name        = "ping-app"
      + node_count  = 3
      + tls_enabled = true
      + version     = "latest"
    }
  + build_information        = {
      + current_hash   = "ef84b4ea74e706a2c7a153dc0291548b5554c82b"
      + file_checksums = {
          + Dockerfile         = "b99b31c3f6a07e54a78a59cfe621b75e88ead5ce"
          + "app.py"           = "4502aabfa03458c1577098e27e97dcb51bc96ae1"
          + "requirements.txt" = "30a2df08091ea684011d2a7124e0c27a59ebff8c"
        }
      + image_id       = (known after apply)
      + image_name     = "ping-app:latest"
      + repo_digest    = (known after apply)
      + trigger_files  = [
          + "Dockerfile",
          + "app.py",
          + "requirements.txt",
        ]
    }
  + container_configuration  = {
      + gunicorn_timeout      = 30
      + gunicorn_workers      = 2
      + health_check_interval = 30
      + memory_limit_mb       = 256
      + memory_swap_mb        = 512
    }
  + deployment_summary       = {
      + app_name          = "ping-app"
      + app_version       = "latest"
      + load_balancer_url = "https://localhost:8080"
      + managed_by        = "terraform"
      + network_subnet    = "172.20.0.0/16"
      + node_count        = 3
      + tls_enabled       = true
    }
  + load_balancer_health_url = "https://localhost:8080/health"
  + load_balancer_url        = "https://localhost:8080"
  + monitoring_endpoints     = {
      + api_ping           = "https://localhost:8080/api/ping"
      + application_health = "https://localhost:8080/health"
      + direct_nodes       = {
          + node-1 = {
              + api    = "http://localhost:5000/api/ping"
              + health = "http://localhost:5000/health"
              + home   = "http://localhost:5000/"
            }
          + node-2 = {
              + api    = "http://localhost:5001/api/ping"
              + health = "http://localhost:5001/health"
              + home   = "http://localhost:5001/"
            }
          + node-3 = {
              + api    = "http://localhost:5002/api/ping"
              + health = "http://localhost:5002/health"
              + home   = "http://localhost:5002/"
            }
        }
    }
  + network_info             = {
      + gateway      = ""
      + network_name = "ping-app-network"
      + subnet       = "172.20.0.0/16"
    }
  + resource_tags            = {
      + ManagedBy  = "terraform"
      + Owner      = "givanov-devops"
      + Project    = "ping-application"
      + app_name   = "ping-app"
      + managed_by = "terraform"
      + version    = "latest"
    }
  + security_configuration   = {
      + rate_limit_burst      = 20
      + rate_limit_per_second = 10
      + security_headers      = true
      + ssl_protocols         = [
          + "TLSv1.2",
          + "TLSv1.3",
        ]
      + tls_enabled           = true
    }
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # docker_container.app_nodes[0] will be created%0A  + resource "docker_container" "app_nodes" {%0A      + attach                                      = false%0A      + bridge                                      = (known after apply)%0A      + command                                     = [%0A          + "gunicorn",%0A          + "--bind",%0A          + "0.0.0.0:5000",%0A          + "--workers",%0A          + "2",%0A          + "--timeout",%0A          + "30",%0A          + "--worker-class",%0A          + "sync",%0A          + "--max-requests",%0A          + "1000",%0A          + "--max-requests-jitter",%0A          + "100",%0A          + "--preload",%0A          + "app:app",%0A        ]%0A      + container_logs                              = (known after apply)%0A      + container_read_refresh_timeout_milliseconds = 15000%0A      + entrypoint                                  = (known after apply)%0A      + env                                         = [%0A          + "APP_NAME=ping-app",%0A          + "FLASK_DEBUG=true",%0A          + "FLASK_HOST=0.0.0.0",%0A          + "FLASK_PORT=5000",%0A          + "LOG_LEVEL=INFO",%0A        ]%0A      + exit_code                                   = (known after apply)%0A      + hostname                                    = (known after apply)%0A      + id                                          = (known after apply)%0A      + image                                       = (known after apply)%0A      + init                                        = (known after apply)%0A      + ipc_mode                                    = (known after apply)%0A      + log_driver                                  = (known after apply)%0A      + logs                                        = false%0A      + memory                                      = 256%0A      + memory_swap                                 = 512%0A      + must_run                                    = true%0A      + name                                        = "ping-app-node-1"%0A      + network_data                                = (known after apply)%0A      + network_mode                                = "bridge"%0A      + read_only                                   = false%0A      + remove_volumes                              = true%0A      + restart                                     = "unless-stopped"%0A      + rm                                          = false%0A      + runtime                                     = (known after apply)%0A      + security_opts                               = (known after apply)%0A      + shm_size                                    = (known after apply)%0A      + start                                       = true%0A      + stdin_open                                  = false%0A      + stop_signal                                 = (known after apply)%0A      + stop_timeout                                = (known after apply)%0A      + tty                                         = false%0A      + wait                                        = false%0A      + wait_timeout                                = 60%0A%0A      + healthcheck {%0A          + interval       = "30s"%0A          + retries        = 3%0A          + start_interval = "0s"%0A          + start_period   = "15s"%0A          + test           = [%0A              + "CMD",%0A              + "curl",%0A              + "-f",%0A              + "http://localhost:5000/health",%0A            ]%0A          + timeout        = "10s"%0A        }%0A%0A      + labels {%0A          + label = "ManagedBy"%0A          + value = "terraform"%0A        }%0A      + labels {%0A          + label = "Owner"%0A          + value = "givanov-devops"%0A        }%0A      + labels {%0A          + label = "Project"%0A          + value = "ping-application"%0A        }%0A      + labels {%0A          + label = "app"%0A          + value = "ping-service"%0A        }%0A      + labels {%0A          + label = "app_name"%0A          + value = "ping-app"%0A        }%0A      + labels {%0A          + label = "component"%0A          + value = "application"%0A        }%0A      + labels {%0A          + label = "managed_by"%0A          + value = "terraform"%0A        }%0A      + labels {%0A          + label = "node_id"%0A          + value = "node-1"%0A        }%0A      + labels {%0A          + label = "version"%0A          + value = "latest"%0A        }%0A%0A      + networks_advanced {%0A          + aliases      = []%0A          + name         = "ping-app-network"%0A            # (2 unchanged attributes hidden)%0A        }%0A%0A      + ports {%0A          + external = 5000%0A          + internal = 5000%0A          + ip       = "0.0.0.0"%0A          + protocol = "tcp"%0A        }%0A    }%0A%0A  # docker_container.app_nodes[1] will be created%0A  + resource "docker_container" "app_nodes" {%0A      + attach                                      = false%0A      + bridge                                      = (known after apply)%0A      + command                                     = [%0A          + "gunicorn",%0A          + "--bind",%0A          + "0.0.0.0:5000",%0A          + "--workers",%0A          + "2",%0A          + "--timeout",%0A          + "30",%0A          + "--worker-class",%0A          + "sync",%0A          + "--max-requests",%0A          + "1000",%0A          + "--max-requests-jitter",%0A          + "100",%0A          + "--preload",%0A          + "app:app",%0A        ]%0A      + container_logs                              = (known after apply)%0A      + container_read_refresh_timeout_milliseconds = 15000%0A      + entrypoint                                  = (known after apply)%0A      + env                                         = [%0A          + "APP_NAME=ping-app",%0A          + "FLASK_DEBUG=true",%0A          + "FLASK_HOST=0.0.0.0",%0A          + "FLASK_PORT=5000",%0A          + "LOG_LEVEL=INFO",%0A        ]%0A      + exit_code                                   = (known after apply)%0A      + hostname                                    = (known after apply)%0A      + id                                          = (known after apply)%0A      + image                                       = (known after apply)%0A      + init                                        = (known after apply)%0A      + ipc_mode                                    = (known after apply)%0A      + log_driver                                  = (known after apply)%0A      + logs                                        = false%0A      + memory                                      = 256%0A      + memory_swap                                 = 512%0A      + must_run                                    = true%0A      + name                                        = "ping-app-node-2"%0A      + network_data                                = (known after apply)%0A      + network_mode                                = "bridge"%0A      + read_only                                   = false%0A      + remove_volumes                              = true%0A      + restart                                     = "unless-stopped"%0A      + rm                                          = false%0A      + runtime                                     = (known after apply)%0A      + security_opts                               = (known after apply)%0A      + shm_size                                    = (known after apply)%0A      + start                                       = true%0A      + stdin_open                                  = false%0A      + stop_signal                                 = (known after apply)%0A      + stop_timeout                                = (known after apply)%0A      + tty                                         = false%0A      + wait                                        = false%0A      + wait_timeout                                = 60%0A%0A      + healthcheck {%0A          + interval       = "30s"%0A          + retries        = 3%0A          + start_interval = "0s"%0A          + start_period   = "15s"%0A          + test           = [%0A              + "CMD",%0A              + "curl",%0A              + "-f",%0A              + "http://localhost:5000/health",%0A            ]%0A          + timeout        = "10s"%0A        }%0A%0A      + labels {%0A          + label = "ManagedBy"%0A          + value = "terraform"%0A        }%0A      + labels {%0A          + label = "Owner"%0A          + value = "givanov-devops"%0A        }%0A      + labels {%0A          + label = "Project"%0A          + value = "ping-application"%0A        }%0A      + labels {%0A          + label = "app"%0A          + value = "ping-service"%0A        }%0A      + labels {%0A          + label = "app_name"%0A          + value = "ping-app"%0A        }%0A      + labels {%0A          + label = "component"%0A          + value = "application"%0A        }%0A      + labels {%0A          + label = "managed_by"%0A          + value = "terraform"%0A        }%0A      + labels {%0A          + label = "node_id"%0A          + value = "node-2"%0A        }%0A      + labels {%0A          + label = "version"%0A          + value = "latest"%0A        }%0A%0A      + networks_advanced {%0A          + aliases      = []%0A          + name         = "ping-app-network"%0A            # (2 unchanged attributes hidden)%0A        }%0A%0A      + ports {%0A          + external = 5001%0A          + internal = 5000%0A          + ip       = "0.0.0.0"%0A          + protocol = "tcp"%0A        }%0A    }%0A%0A  # docker_container.app_nodes[2] will be created%0A  + resource "docker_container" "app_nodes" {%0A      + attach                                      = false%0A      + bridge                                      = (known after apply)%0A      + command                                     = [%0A          + "gunicorn",%0A          + "--bind",%0A          + "0.0.0.0:5000",%0A          + "--workers",%0A          + "2",%0A          + "--timeout",%0A          + "30",%0A          + "--worker-class",%0A          + "sync",%0A          + "--max-requests",%0A          + "1000",%0A          + "--max-requests-jitter",%0A          + "100",%0A          + "--preload",%0A          + "app:app",%0A        ]%0A      + container_logs                              = (known after apply)%0A      + container_read_refresh_timeout_milliseconds = 15000%0A      + entrypoint                                  = (known after apply)%0A      + env                                         = [%0A          + "APP_NAME=ping-app",%0A          + "FLASK_DEBUG=true",%0A          + "FLASK_HOST=0.0.0.0",%0A          + "FLASK_PORT=5000",%0A          + "LOG_LEVEL=INFO",%0A        ]%0A      + exit_code                                   = (known after apply)%0A      + hostname                                    = (known after apply)%0A      + id                                          = (known after apply)%0A      + image                                       = (known after apply)%0A      + init                                        = (known after apply)%0A      + ipc_mode                                    = (known after apply)%0A      + log_driver                                  = (known after apply)%0A      + logs                                        = false%0A      + memory                                      = 256%0A      + memory_swap                                 = 512%0A      + must_run                                    = true%0A      + name                                        = "ping-app-node-3"%0A      + network_data                                = (known after apply)%0A      + network_mode                                = "bridge"%0A      + read_only                                   = false%0A      + remove_volumes                              = true%0A      + restart                                     = "unless-stopped"%0A      + rm                                          = false%0A      + runtime                                     = (known after apply)%0A      + security_opts                               = (known after apply)%0A      + shm_size                                    = (known after apply)%0A      + start                                       = true%0A      + stdin_open                                  = false%0A      + stop_signal                                 = (known after apply)%0A      + stop_timeout                                = (known after apply)%0A      + tty                                         = false%0A      + wait                                        = false%0A      + wait_timeout                                = 60%0A%0A      + healthcheck {%0A          + interval       = "30s"%0A          + retries        = 3%0A          + start_interval = "0s"%0A          + start_period   = "15s"%0A          + test           = [%0A              + "CMD",%0A              + "curl",%0A              + "-f",%0A              + "http://localhost:5000/health",%0A            ]%0A          + timeout        = "10s"%0A        }%0A%0A      + labels {%0A          + label = "ManagedBy"%0A          + value = "terraform"%0A        }%0A      + labels {%0A          + label = "Owner"%0A          + value = "givanov-devops"%0A        }%0A      + labels {%0A          + label = "Project"%0A          + value = "ping-application"%0A        }%0A      + labels {%0A          + label = "app"%0A          + value = "ping-service"%0A        }%0A      + labels {%0A          + label = "app_name"%0A          + value = "ping-app"%0A        }%0A      + labels {%0A          + label = "component"%0A          + value = "application"%0A        }%0A      + labels {%0A          + label = "managed_by"%0A          + value = "terraform"%0A        }%0A      + labels {%0A          + label = "node_id"%0A          + value = "node-3"%0A        }%0A      + labels {%0A          + label = "version"%0A          + value = "latest"%0A        }%0A%0A      + networks_advanced {%0A          + aliases      = []%0A          + name         = "ping-app-network"%0A            # (2 unchanged attributes hidden)%0A        }%0A%0A      + ports {%0A          + external = 5002%0A          + internal = 5000%0A          + ip       = "0.0.0.0"%0A          + protocol = "tcp"%0A        }%0A    }%0A%0A  # docker_container.load_balancer will be created%0A  + resource "docker_container" "load_balancer" {%0A      + attach                                      = false%0A      + bridge                                      = (known after apply)%0A      + command                                     = (known after apply)%0A      + container_logs                              = (known after apply)%0A      + container_read_refresh_timeout_milliseconds = 15000%0A      + entrypoint                                  = (known after apply)%0A      + env                                         = (known after apply)%0A      + exit_code                                   = (known after apply)%0A      + hostname                                    = (known after apply)%0A      + id                                          = (known after apply)%0A      + image                                       = (known after apply)%0A      + init                                        = (known after apply)%0A      + ipc_mode                                    = (known after apply)%0A      + log_driver                                  = (known after apply)%0A      + logs                                        = false%0A      + memory                                      = 128%0A      + memory_swap                                 = 256%0A      + must_run                                    = true%0A      + name                                        = "ping-app-lb"%0A      + network_data                                = (known after apply)%0A      + network_mode                                = "bridge"%0A      + read_only                                   = false%0A      + remove_volumes                              = true%0A      + restart                                     = "unless-stopped"%0A      + rm                                          = false%0A      + runtime                                     = (known after apply)%0A      + security_opts                               = (known after apply)%0A      + shm_size                                    = (known after apply)%0A      + start                                       = true%0A      + stdin_open                                  = false%0A      + stop_signal                                 = (known after apply)%0A      + stop_timeout                                = (known after apply)%0A      + tty                                         = false%0A      + wait                                        = false%0A      + wait_timeout                                = 60%0A%0A      + healthcheck (known after apply)%0A%0A      + labels {%0A          + label = "ManagedBy"%0A          + value = "terraform"%0A        }%0A      + labels {%0A          + label = "Owner"%0A          + value = "givanov-devops"%0A        }%0A      + labels {%0A          + label = "Project"%0A          + value = "ping-application"%0A        }%0A      + labels {%0A          + label = "app"%0A          + value = "nginx"%0A        }%0A      + labels {%0A          + label = "app_name"%0A          + value = "ping-app"%0A        }%0A      + labels {%0A          + label = "component"%0A          + value = "load-balancer"%0A        }%0A      + labels {%0A          + label = "managed_by"%0A          + value = "terraform"%0A        }%0A      + labels {%0A          + label = "version"%0A          + value = "latest"%0A        }%0A%0A      + networks_advanced {%0A          + aliases      = []%0A          + name         = "ping-app-network"%0A            # (2 unchanged attributes hidden)%0A        }%0A%0A      + ports {%0A          + external = 8080%0A          + internal = 443%0A          + ip       = "0.0.0.0"%0A          + protocol = "tcp"%0A        }%0A%0A      + upload {%0A          # At least one attribute in this block is (or was) sensitive,%0A          # so its contents will not be displayed.%0A        }%0A      + upload {%0A          # At least one attribute in this block is (or was) sensitive,%0A          # so its contents will not be displayed.%0A        }%0A      + upload {%0A          # At least one attribute in this block is (or was) sensitive,%0A          # so its contents will not be displayed.%0A        }%0A    }%0A%0A  # docker_image.nginx will be created%0A  + resource "docker_image" "nginx" {%0A      + id           = (known after apply)%0A      + image_id     = (known after apply)%0A      + keep_locally = true%0A      + name         = "nginx:alpine"%0A      + repo_digest  = (known after apply)%0A    }%0A%0A  # docker_image.ping_app will be created%0A  + resource "docker_image" "ping_app" {%0A      + id           = (known after apply)%0A      + image_id     = (known after apply)%0A      + keep_locally = true%0A      + name         = "ping-app:latest"%0A      + repo_digest  = (known after apply)%0A      + triggers     = {%0A          + "source_files_sha1" = "ef84b4ea74e706a2c7a153dc0291548b5554c82b"%0A        }%0A%0A      + build {%0A          + build_args     = {%0A              + "APP_PORT" = "5000"%0A              + "VCS_REF"  = "latest"%0A            }%0A          + cache_from     = []%0A          + context        = "."%0A          + dockerfile     = "Dockerfile"%0A          + extra_hosts    = []%0A          + no_cache       = false%0A          + remove         = true%0A          + security_opt   = []%0A          + tag            = []%0A            # (13 unchanged attributes hidden)%0A        }%0A    }%0A%0A  # docker_network.app_network will be created%0A  + resource "docker_network" "app_network" {%0A      + driver      = "bridge"%0A      + id          = (known after apply)%0A      + internal    = (known after apply)%0A      + ipam_driver = "default"%0A      + name        = "ping-app-network"%0A      + options     = (known after apply)%0A      + scope       = (known after apply)%0A%0A      + ipam_config {%0A          + subnet   = "172.20.0.0/16"%0A            # (2 unchanged attributes hidden)%0A        }%0A%0A      + labels {%0A          + label = "ManagedBy"%0A          + value = "terraform"%0A        }%0A      + labels {%0A          + label = "Owner"%0A          + value = "givanov-devops"%0A        }%0A      + labels {%0A          + label = "Project"%0A          + value = "ping-application"%0A        }%0A      + labels {%0A          + label = "app_name"%0A          + value = "ping-app"%0A        }%0A      + labels {%0A          + label = "component"%0A          + value = "network"%0A        }%0A      + labels {%0A          + label = "managed_by"%0A          + value = "terraform"%0A        }%0A      + labels {%0A          + label = "version"%0A          + value = "latest"%0A        }%0A    }%0A%0A  # tls_private_key.internal_ca[0] will be created%0A  + resource "tls_private_key" "internal_ca" {%0A      + algorithm                     = "RSA"%0A      + ecdsa_curve                   = "P224"%0A      + id                            = (known after apply)%0A      + private_key_openssh           = (sensitive value)%0A      + private_key_pem               = (sensitive value)%0A      + private_key_pem_pkcs8         = (sensitive value)%0A      + public_key_fingerprint_md5    = (known after apply)%0A      + public_key_fingerprint_sha256 = (known after apply)%0A      + public_key_openssh            = (known after apply)%0A      + public_key_pem                = (known after apply)%0A      + rsa_bits                      = 2048%0A    }%0A%0A  # tls_self_signed_cert.internal_ca[0] will be created%0A  + resource "tls_self_signed_cert" "internal_ca" {%0A      + allowed_uses          = [%0A          + "key_encipherment",%0A          + "digital_signature",%0A          + "cert_signing",%0A        ]%0A      + cert_pem              = (known after apply)%0A      + early_renewal_hours   = 0%0A      + id                    = (known after apply)%0A      + is_ca_certificate     = true%0A      + key_algorithm         = (known after apply)%0A      + private_key_pem       = (sensitive value)%0A      + ready_for_renewal     = false%0A      + set_authority_key_id  = false%0A      + set_subject_key_id    = false%0A      + validity_end_time     = (known after apply)%0A      + validity_period_hours = 8760%0A      + validity_start_time   = (known after apply)%0A%0A      + subject {%0A          + common_name  = "Internal CA"%0A          + organization = "ping-application"%0A        }%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + app_nodes                = {%0A      + node-1 = {%0A          + direct_url    = "http://localhost:5000"%0A          + external_port = 5000%0A          + health_url    = "http://localhost:5000/health"%0A          + hostname      = (known after apply)%0A          + internal_ip   = (known after apply)%0A          + internal_port = 5000%0A          + name          = "ping-app-node-1"%0A        }%0A      + node-2 = {%0A          + direct_url    = "http://localhost:5001"%0A          + external_port = 5001%0A          + health_url    = "http://localhost:5001/health"%0A          + hostname      = (known after apply)%0A          + internal_ip   = (known after apply)%0A          + internal_port = 5000%0A          + name          = "ping-app-node-2"%0A        }%0A      + node-3 = {%0A          + direct_url    = "http://localhost:5002"%0A          + external_port = 5002%0A          + health_url    = "http://localhost:5002/health"%0A          + hostname      = (known after apply)%0A          + internal_ip   = (known after apply)%0A          + internal_port = 5000%0A          + name          = "ping-app-node-3"%0A        }%0A    }%0A  + application_info         = {%0A      + name        = "ping-app"%0A      + node_count  = 3%0A      + tls_enabled = true%0A      + version     = "latest"%0A    }%0A  + build_information        = {%0A      + current_hash   = "ef84b4ea74e706a2c7a153dc0291548b5554c82b"%0A      + file_checksums = {%0A          + Dockerfile         = "b99b31c3f6a07e54a78a59cfe621b75e88ead5ce"%0A          + "app.py"           = "4502aabfa03458c1577098e27e97... 

  [TRUNCATED - View full plan in artifacts]
```

</details>

---

## 🚀 Approval Instructions

Please **carefully review** the changes above and respond with:
- **approve** or **lgtm** or **yes** ✅ to proceed with deployment
- **deny** or **no** ❌ to cancel the deployment

**⚠️ Warning:** This will make changes to production infrastructure!

---

📎 **Additional Resources:**
- [📦 View Artifacts](https://github.com/givanov-devops/personal-stuff/actions/runs/16623148667)
- [🔄 View Workflow Run](https://github.com/givanov-devops/personal-stuff/actions/runs/16623148667)
- [📝 View Commit](https://github.com/givanov-devops/personal-stuff/commit/1eb0f0da76f1e14e5fd84aa091683e306b4dde6a)
